In [38]:
import pandas as pd

# concat()

concatenation:<br>
The operation of joining two or more character strings, values, or data sets end-to-end to create a single, longer string or sequence

In [39]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['E', 'F', 'G', 'F'],
                    'age': [40, 21, 19, 24]})

In [40]:
# tho concatenate the two dataframes we can use concat() method of pandas library 
pd.concat([df1, df2])

  id  age
0  A   30
1  B   23
2  C   25
3  D   22
0  E   40
1  F   21
2  G   19
3  F   24

In [41]:
# if you see the aboves example output you will see that the index is repeated because we are concatenating along rows and by default the index is not reseted so to reset the index we can use ignore_index parameter and set it to True
pd.concat([df1, df2], ignore_index=True)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22
4  E   40
5  F   21
6  G   19
7  F   24

In [42]:
# we can specify the axis parameter to concatenate along rows or columns
# to concatenate along rows we have to use axis = 0 
# by default the aixs is 0
pd.concat([df1, df2], axis=0, ignore_index=True)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22
4  E   40
5  F   21
6  G   19
7  F   24

In [43]:
# to concatenate along columns we have to use axis = 1
pd.concat([df1, df2], axis=1)

  id  age id  age
0  A   30  E   40
1  B   23  F   21
2  C   25  G   19
3  D   22  F   24

# merge()

merge means <br>
to combine or join

In [44]:
df1 = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
    'Age': [27, 24, 22, 32],
})

df2 = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
    'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons'],
})

In [45]:
# here we are merging the two dataframes on the common column 'key' and by default it will perform an inner join which means it will only keep the rows that have matching keys in both dataframes
# here if we observe the two dataframes we have two one common column which is 'key'
# to merge by using the common column we can use on parameter and the name of the commom column
pd.merge(df1, df2, on='key')

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [46]:
pd.merge(df1, df2, on='key', how='inner')  # inner join

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [48]:

pd.merge(df1, df2,on = 'key', how='outer')  # outer join

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons